from string import Template

### RAG PROMPTS ###

## System ##

system_prompt = Template(
    "\n".join([
        "أنت مساعد ذكي مسؤول عن إنشاء إجابة للمستخدم.",
        "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
        "يجب عليك إنشاء إجابة اعتمادًا على المستندات المقدمة فقط.",
        "تجاهل المستندات غير المرتبطة باستفسار المستخدم.",
        "يمكنك الاعتذار إذا لم تتوفر معلومات كافية للإجابة على استفسار المستخدم.",
        "يجب أن تكون الإجابة بنفس لغة استفسار المستخدم.",
        "كن مهذبًا ومختصرًا في إجابتك.",
        "كن دقيقًا ومباشرًا وتجنب التفاصيل غير الضرورية.",
    ])
)

### Document ###

document_prompt = Template(
    "\n".join([
        "## رقم المستند: $doc_no",
        "### المحتوى: $chunk_text"
    ])
)

### Footer ###

footer_prompt = Template(
    "\n".join([
        "اعتمادًا فقط على المستندات السابقة، قم بإنشاء إجابة للاستفسار التالي:",
        "## السؤال:",
        "$query",
        "## الإجابة:"
    ])
)